load.yaml
execution:
- executor: pbench
  concurrency: 100
  ramp-up: 1m
  hold-for: 10m
  iterations: 5
  throughput: 10
  scenario: simple_usage

scenarios:
  simple_usage:  
    default-address: https://example.com:443/
    requests:
    - /
reporting:
- module: influxdbuploader



modules:
  console:
    disable: true
  influxdbuploader:
    influxdb-address:   # influxdb address
    influxdb-port:      # influxdb port
    influxdb-user:      # influxdb username which can also be defined in envrironemnt variables INFLUXDB_USER
    influxdb-password:  # influxdb password which can also be defined in envrironemnt variables INFLUXDB_PASSWORD
    influxdb-database:  # influxdb database
    dashboard-url:      # grafana dashboard url, like https://<GRAFANA_WEBUI_HOST>/d/<DASHBOARD_ID>/<DASHBOARD_NAME>
    project:            # custom project name
    # custom-tags:
      # key1: value1
      # key2: value2  
    browser-open: start  # auto-open the report in browser, 
                         # can be "start", "end", "both", "none"
    send-interval: 10s   # send data each n-th second
    timeout: 5s  # connect and request timeout for BlazeMeter API